POSITIONS=[
{'장소명': "스타벅스 신림타임스트림점" ,
'주소': "서울 관악구 신림로 330" ,
'전화번호': "1522-3232" ,
'위도, 경도': [ 37.4839979456956 , 126.930102913928 ] ,
'상세정보페이지 url': "http://place.map.kakao.com/19526058" ,
'반경': 50 },
#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-

{'장소명': "스타벅스 신림점" ,
'주소': "서울 관악구 신림로 355-1" ,
'전화번호': "1522-3232" ,
'위도, 경도': [ 37.4861165935404 , 126.92922352724 ] ,
'상세정보페이지 url': "http://place.map.kakao.com/7977701" ,
'반경': 213 },
#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-

{'장소명': "스타벅스 보라매대교빌딩점" ,
'주소': "서울 관악구 보라매로3길 23" ,
'전화번호': "1522-3232" ,
'위도, 경도': [ 37.491190595489165 , 126.9255222751619 ] ,
'상세정보페이지 url': "http://place.map.kakao.com/1974174375" ,
'반경': 853 },
#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-

{'장소명': "스타벅스 보라매공원R점" ,
'주소': "서울 동작구 보라매로5길 35" ,
'전화번호': "1522-3232" ,
'위도, 경도': [ 37.4920885148138 , 126.923509731908 ] ,
'상세정보페이지 url': "http://place.map.kakao.com/755423338" ,
'반경': 1025 },
#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-

{'장소명': "스타벅스 봉천역" ,
'주소': "서울 관악구 남부순환로 1730" ,
'전화번호': "1522-3232" ,
'위도, 경도': [ 37.48203672006856 , 126.94228157472476 ] ,
'상세정보페이지 url': "http://place.map.kakao.com/1343076754" ,
'반경': 1147 },
#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-

{'장소명': "스타벅스 봉천현대시장" ,
'주소': "서울 관악구 은천로 118" ,
'전화번호': "1522-3232" ,
'위도, 경도': [ 37.48659860161536 , 126.94828205055107 ] ,
'상세정보페이지 url': "http://place.map.kakao.com/923050710" ,
'반경': 1673 },
#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-

{'장소명': "스타벅스 신림녹두거리점" ,
'주소': "서울 관악구 신림로 99" ,
'전화번호': "1522-3232" ,
'위도, 경도': [ 37.4704053531146 , 126.93825481255969 ] ,
'상세정보페이지 url': "http://place.map.kakao.com/936949903" ,
'반경': 1713 },
#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-

{'장소명': "스타벅스 신대방삼거리역점" ,
'주소': "서울 동작구 상도로 102" ,
'전화번호': "1522-3232" ,
'위도, 경도': [ 37.50020359704819 , 126.93187915489521 ] ,
'상세정보페이지 url': "http://place.map.kakao.com/525622050" ,
'반경': 1785 },
#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-

{'장소명': "스타벅스 신림DT점" ,
'주소': "서울 관악구 남부순환로 1419" ,
'전화번호': "" ,
'위도, 경도': [ 37.480980972238186 , 126.90842516192575 ] ,
'상세정보페이지 url': "http://place.map.kakao.com/784815881" ,
'반경': 1907 },
#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-

{'장소명': "스타벅스 서울대입구역점" ,
'주소': "서울 관악구 남부순환로 1812" ,
'전화번호': "1522-3232" ,
'위도, 경도': [ 37.4811758306639 , 126.951342964083 ] ,
'상세정보페이지 url': "http://place.map.kakao.com/17127069" ,
'반경': 1952 },
#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-

{'장소명': "스타벅스 서울대역점" ,
'주소': "서울 관악구 남부순환로 1817" ,
'전화번호': "1522-3232" ,
'위도, 경도': [ 37.4816085683419 , 126.951962262615 ] ,
'상세정보페이지 url': "http://place.map.kakao.com/1594953144" ,
'반경': 1998 },
#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-

{'장소명': "스타벅스 관악서울대입구R점" ,
'주소': "서울 관악구 관악로 158" ,
'전화번호': "1522-3232" ,
'위도, 경도': [ 37.4793095346793 , 126.952809411366 ] ,
'상세정보페이지 url': "http://place.map.kakao.com/2074224653" ,
'반경': 2123 },
#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-

{'장소명': "스타벅스 서울대입구역8번출구점" ,
'주소': "서울 관악구 남부순환로 1831" ,
'전화번호': "1522-3232" ,
'위도, 경도': [ 37.4811812723318 , 126.95367315277564 ] ,
'상세정보페이지 url': "http://place.map.kakao.com/643067406" ,
'반경': 2155 },
#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-

{'장소명': "스타벅스 숭실대입구역점" ,
'주소': "서울 동작구 상도로 354" ,
'전화번호': "1522-3232" ,
'위도, 경도': [ 37.4968611472544 , 126.952757658619 ] ,
'상세정보페이지 url': "http://place.map.kakao.com/27332485" ,
'반경': 2482 },
#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-

{'장소명': "스타벅스 장승배기역점" ,
'주소': "서울 동작구 장승배기로11가길 11" ,
'전화번호': "1522-3232" ,
'위도, 경도': [ 37.505806418890344 , 126.93915872970295 ] ,
'상세정보페이지 url': "http://place.map.kakao.com/555561951" ,
'반경': 2540 },
#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-#-

]



ICON_COLOR_BY_DISTANCE = { #15000 m -> 15km
    'grade0': {'color':'green', 'icon_color':'yellow','icon':'flag'},
    'grade1': {'color':'red', 'icon_color':'yellow','icon':'flag'},
    'grade2': {'color':'blue', 'icon_color':'yellow','icon':'flag'},
    'grade3': {'color':'yellow', 'icon_color':'yellow','icon':'flag'},
    'grade4': {'color':'brown', 'icon_color':'yellow','icon':'flag'}
    # icon2= folium.Icon(color='green',icon_color='yellow',icon='flag') # 내부적으로 연결되어 있음. 
    
}